Repository: alcinnz/Oddysseus
Catalog: po/extra/*.po
Languages: fr

source: Surf knowledge, entertainment, and services on The Web
fr: Explorez les savoirs, les divertissements, et les services du web

source: WWW;Web;Internet;Browser;
fr: WWW;Web;Internet;Navigateur;

source: New Window
fr: Nouvelle fenêtre

source: New Tab
fr: Nouvel onglet

source: Odysseus web browser
fr: Navigateur Web Odysseus

source: A simple and performant yet powerful window onto the open decentralized web
fr: Une fenêtre simple et performante vers le Web décentralisé et ouvert

source: Odysseus is a simple yet powerful web browser focusing on new ways to discover the webpages you need and want, without relying on central webservices invading your privacy.
fr: Odysseus est un navigateur Web simple et puissant centré sur de nouvelles façons de découvrir les pages Web que vous avez besoin et que vous voulez, sans dépendre de services en ligne invasifs pour votre vie privée.

source: These discovery features include:
fr: Ces fonctionnalités de découverte incluent :

source: Top sites, with initial handcurated recommendations
fr: Sites à la une, avec des recommandations manuelles

source: Personalized suggestions, harvested from the pages you visit
fr: Suggestions personalisées, à partir des pages que vous visitez

source: Webfeed discovery, integrating with existing feedreaders
fr: Découverte du flux Web, intégration avec les lecteurs de flux existants

source: Easily skimmed browser history, with full-text search
fr: Historique de navigation facile à parcourir, avec recherche de texte intégral

source: Failing to open a link, suggests compatible apps to install
fr: En cas d'échec de l'ouverture d'un lien, suggère des applications compatibles à installer

source: Homepage, autocompletion
fr: Page d'accueil, autocomplétion

source: History
fr: Historique

source: Downloads, find-in-page
fr: Téléchargements, rechercher dans la page

source: Webfeed subscription
fr: Abonnement à un flux Web

source: New icon thanks to Fatih20 (Nararyans R.I.)
fr: Nouvelle icône grâce ) Fatih20 (Nararyans R.I.)

source: Fix crash resulting from opening local files (the OS no longer provides the "file://"-prefix).
fr: Correction d'un plantage lors de l'ouverture de fichiers locaux (le système d'exploitation ne fournit plus le préfixe « file:// »).

source: Expose YouTube webfeeds.
fr: Affichage des flux Web de YouTube.

source: Fix personalized recommendation display.
fr: Correction de l'affichage des recommandations personnalisées.

source: Performance fixes for personalized recommendations.
fr: Corrections des performances pour les recommandations personnalisées.

source: Use non-colourful icons.
fr: Utilisation d'icônes non colorées.

source: Integrate history link deeper into topsites display.
fr: Intégration plus poussée du lien à l'historique dans l'affichage des sites à la une.

source: Personalized recommendations
fr: Recommandations personnalisées

source: Performance optimizations (tidies up database)
fr: Optimisation des performances (nettoyage de la base de données)

source: Reader Mode
fr: Mode lecture

source: Minor layout fix
fr: Correction mineure de la disposition

source: Show download count
fr: Affichage du nombre de téléchargements

source: Preparation to support a global dark mode
fr: Préparation à la prise en charge d'un thème sombre général

source: Webfeed discovery support!
fr: Prise en charge de la découverte de flux Web !

source: Full Dutch localization
fr: Traduction en néerlandais

source: Fix topsites editing
fr: Correction de la modification des sites à la une

source: Lower threshold for sourcing topsites from browser history
fr: Seuil réduit pour la récupération des sites à la une depuis l'historique du navigateur

source: Minor performance improvements
fr: Améliorations mineures des performances

source: Enable MSE, full French translations.
fr: Activation de MSE, traduction en français.

source: Minor visual corrections.
fr: Corrections visuelles mineures.

source: Visually tie status icons to addressbar again, revert having icons in application menu.
fr: Réaffichage des icônes de statut dans la barre d'adresse, annulation des icônes dans le menu de l'application.

source: Fixes for other themes.
fr: Corrections pour les autres thèmes/

source: Indicates HTTPS (with it's cryptographic certificate) and local pages, errors, and permissions.
fr: Indication du HTTPS (avec un certificat cryptographique), des pages locales, des erreurs et des permissions.

source: Indicates HTTPS and local pages.
fr: Indication du HTTPS et des pages locales.

source: Performance fixes and better labelling on topsites display.
fr: Corrections des performances et meilleur étiquettes dans l'affichage des sites à la une.

source: Hides downloads bar in fullscreen.
fr: La barre des téléchargements est désormais masquée en plein écran.

source: Renders nice previews for webfeeds.
fr: Meilleur aperçu de rendu pour les flux Web.

source: Fixes regressions with topsites interactions and viewsource.
fr: Correction des regressions avec les intéractions des sites à la une et l'affichage de la source.

source: Fixes for Juno.
fr: Corrections pour Juno.

source: Topsites performance and design improvements.
fr: Amélioration des performances et de la mise en page des sites à la une.

source: Add indicators for menuitems that are links.
fr: Ajout d'indicateurs pour les éléments du menu qui sont des liens.

source: Major performance improvements in regards to internal pages. i.e. stops wasting time wasting memory.
fr: Améliorations majeures des performances pour les pages internes, cela arrête désormais de gaspiller de la mémoire.

source: Recommends apps for unsupported URL and file types.
fr: Applications recommandées pour les URL et types de fichiers non pris en charge.

source: Improved accessibility of the downloads bar.
fr: Amélioration de l'accessibilité de la barre des téléchargements.

source: Fills in gaps within the topsites display with my recommendations.
fr: Correction des espaces blancs avec l'affichage des sites à la une avec mes recommandations.

source: More succinct text in download notifications.
fr: Texte raccourci dans les notifications de téléchargement.

source: You can customize the topsites on odysseus:home!
fr: Vous pouvez personnaliser les sites à la une sur odysseurs:home !

source: Minor optimizations to odysseus:history.
fr: Optimisations mineures sur odysseus:history.

source: Your most visited pages are now linked to from the newtab page.
fr: Les pages que vous visitez le plus sont désormais liées à la page nouvel onglet.

source: Now speaks French and Portuguese.
fr: Traduction en français et en portgugais.

source: Added credits page to thank contributors.
fr: Ajout d'une page de crédits pour remercier les contributeurs.

source: More minor UI corrections.
fr: Encore des corrections mineures de l'interface.

source: More communicative browser history viewer, with colour coded tabs, tooltips communicating which links you've followed, favicons, page screenshots, and years in all dates.
fr: Vue de l'historique du navigateur plus communicante, avec des onglets codés par couleur, des infobulles sur les liens que vous avez suivi, l'affichage des favicons, des captures d'écran des pages et l'année dans toutes les dates.

source: Fixes for video playback and infinite tab spawnage.
fr: Corrections de la lecture vidéo et du chargement infini de l'onglet.

source: Added a privacy notice.
fr: Ajout d'un avertissement de confidentialité.

source: Natural search of your browser history
fr: Recherche naturelle dans votre historique de navigation

source: Added useful "hints" to the footer of the newtab page, which may link to a new credits page.
fr: Ajout d'« astuces » pratiques au pied de la page nouvel onglet, qui peuvent amener vers une nouvelle page de crédits.

source: Reduced prevalance of the "loading" message.
fr: Réduction de l'importance du message de « chargement ».

source: Now speaks Czech.
fr: Traduction en tchèque.

source: Tabs now open in background.
fr: Les onglets s'ouvrent désormais en arrière-plan.

source: Short-term style fix for plus.google.com.
fr: Correction à court-terme pour plus.google.com

source: Preparations for more localization.
fr: Préparations pour plus de traductions.

source: Adds more keyboard and middle click shortcuts.
fr: Ajout de nouveaux raccourcis clavier et avec le bouton central de la souris.

source: Fixes links displayed in AppCenter.
fr: Correction des liens affichés dans le Centre d'Applications.

source: Hopefully this makes it display better in AppCenter.
fr: En espérant que cela s'affichera mieux dans le Centre d'Applications.

source: Bugfix: a tab always remains open in each window.
fr: Correction de bug : Un onglet reste toujours ouvert dans chaque fenêtre.

source: Disable broken WebInspector for now.
fr: Désactivation de l'inspecteur Web non fonctionnel pour l'instant.

source: If you have the know-how to fix https://github.com/alcinnz/Odysseus/issues/54, please help.
fr: Si vous avez les connaissances pour corriger https://github.com/alcinnz/Odysseus/issues/54, votre aide est la bienvenue.

source: Offers a very smooth browsing and downloads experience.
fr: Expérience de navigation et de téléchargement très fluide.

source: First AppCenter release, so Merry Christmas!
fr: Première version dans le Centre d'Applications, joyeux Noël !
